In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split as tts
import sklearn.feature_selection as fs
from sklearn.linear_model import LogisticRegression
from sklearn import metrics

In [2]:
df = pd.read_csv('assets/1655502677_insurance_consument.csv')
df

,id,first_name,last_name,email,gender,age,marital_status,country,work,salary(million),have_car,car_band,is_join
0,1,Dew,Willisch,dwillisch0@mac.com,Male,40,True,Tanzania,Statistician II,17,1,Mitsubishi,1
1,2,Cyndi,McGown,cmcgown1@mashable.com,Genderfluid,42,False,Poland,Software Consultant,22,1,Chevrolet,0
2,3,Mirabella,Ainscough,mainscough2@loc.gov,Female,23,True,Indonesia,Senior Quality Engineer,13,0,NaN,0
3,4,Pammy,Westbrook,pwestbrook3@google.com,Female,20,True,Indonesia,Senior Developer,13,1,Isuzu,1
4,5,Joleen,Labin,jlabin4@hugedomains.com,Female,28,True,United States,Staff Scientist,17,1,Ford,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,496,Kaiser,Shewery,kshewerydr@epa.gov,Non-binary,43,True,Czech Republic,Senior Developer,23,1,Lamborghini,1
496,497,Torey,Giovannilli,tgiovannillids@barnesandnoble.com,Female,30,False,Syria,Chief Design Engineer,10,0,NaN,1
497,498,Zebulon,Bindon,zbindondt@amazon.com,Male,26,True,Sweden,Product Engineer,11,1,BMW,0
498,499,Giuditta,Brewerton,gbrewertondu@1688.com,Female,20,False,China,Staff Accountant II,17,1,Infiniti,1
499,500,Staford,Ericssen,sericssendv@weibo.com,Male,54,True,Myanmar,Librarian,12,1,Ford,1

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               500 non-null    int64
 1   first_name       500 non-null    object
 2   last_name        500 non-null    object
 3   email            500 non-null    object
 4   gender           500 non-null    object
 5   age              500 non-null    int64
 6   marital_status   500 non-null    bool
 7   country          500 non-null    object
 8   work             500 non-null    object
 9   salary(million)  500 non-null    int64
 10  have_car         500 non-null    int64
 11  car_band         357 non-null    object
 12  is_join          500 non-null    int64
dtypes: bool(1), int64(5), object(7)
memory usage: 47.5+ KB

In [4]:
df.describe()

               id         age  salary(million)    have_car     is_join
count  500.000000  500.000000       500.000000  500.000000  500.000000
mean   250.500000   35.516000        16.992000    0.714000    0.414000
std    144.481833    9.503809         4.040369    0.452342    0.493042
min      1.000000   20.000000         8.000000    0.000000    0.000000
25%    125.750000   29.000000        14.000000    0.000000    0.000000
50%    250.500000   35.000000        17.000000    1.000000    0.000000
75%    375.250000   41.000000        20.000000    1.000000    1.000000
max    500.000000   67.000000        29.000000    1.000000    1.000000

In [5]:
df.isna().sum()

id                   0
first_name           0
last_name            0
email                0
gender               0
age                  0
marital_status       0
country              0
work                 0
salary(million)      0
have_car             0
car_band           143
is_join              0
dtype: int64

In [6]:
df.drop(["id", "first_name", "last_name", "email"], axis=1, inplace=True)
df.drop(['country', 'work', 'car_band'], axis=1, inplace=True)
#df.drop(['marital_status'], axis=1, inplace=True)

In [7]:
df.drop(['gender'], axis=1, inplace=True)

In [8]:
df.head()

   age  marital_status  salary(million)  have_car  is_join
0   40            True               17         1        1
1   42           False               22         1        0
2   23            True               13         0        0
3   20            True               13         1        1
4   28            True               17         1        1

In [9]:
df['marital_status'].replace([True, False],[1, 0], inplace=True)

In [10]:
df.head()

   age  marital_status  salary(million)  have_car  is_join
0   40               1               17         1        1
1   42               0               22         1        0
2   23               1               13         0        0
3   20               1               13         1        1
4   28               1               17         1        1

In [11]:
X = df[["age", "marital_status", "salary(million)", "have_car"]]
y = df[["is_join"]]

In [12]:
model_lr = LogisticRegression(solver='lbfgs')
rfe = fs.RFE(model_lr)
rfe.fit(X,y.values.ravel())
print(f'Support = {rfe.support_}')
print(f'Ranking = {rfe.ranking_}')

Support = [False  True False  True]
Ranking = [3 1 2 1]

In [13]:
X = df[["marital_status", "have_car"]]

In [14]:
x_train, x_test, y_train, y_test = tts(X, y, random_state=18, test_size=0.05)
print(f'dimensi dari X_train : {len(x_train)}')
print(f'dimensi dari y_train : {len(y_train)}')
print(f'dimensi dari X_test : {len(x_test)}')
print(f'dimensi dari y_test : {len(y_test)}')

dimensi dari X_train : 475
dimensi dari y_train : 475
dimensi dari X_test : 25
dimensi dari y_test : 25

In [15]:
model_lr.fit(x_train, y_train.values.ravel())

LogisticRegression()

In [16]:
y_predict = model_lr.predict(x_test)
auc = metrics.accuracy_score(y_test, y_predict)

print(f'Nilai AUC : {auc}')

Nilai AUC : 0.72

In [17]:
from sklearn.metrics import confusion_matrix
confusion_matrix = confusion_matrix(y_test, y_predict)
print(confusion_matrix)

[[18  0]
 [ 7  0]]

In [18]:
from sklearn.metrics import classification_report
print(classification_report(y_test, y_predict))

              precision    recall  f1-score   support

           0       0.72      1.00      0.84        18
           1       0.00      0.00      0.00         7

    accuracy                           0.72        25
   macro avg       0.36      0.50      0.42        25
weighted avg       0.52      0.72      0.60        25

/home/sofi/anaconda3/envs/py37/lib/python3.7/site-packages/sklearn/metrics/_classification.py:1318: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
/home/sofi/anaconda3/envs/py37/lib/python3.7/site-packages/sklearn/metrics/_classification.py:1318: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
/home/sofi/anaconda3/envs/py37/lib/python3.7/site-packages/sklearn/metrics/_classification.py:1318: UndefinedMetricWarning: Precision and F-score are ill-defined and being set to 0.0 in labels with no predicted samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))

In [19]:
print(df[df["is_join"]==1])
print(df[df["is_join"]==0])

     age  marital_status  salary(million)  have_car  is_join
0     40               1               17         1        1
3     20               1               13         1        1
4     28               1               17         1        1
5     20               1               12         1        1
6     31               0               16         0        1
..   ...             ...              ...       ...      ...
493   21               1               16         1        1
495   43               1               23         1        1
496   30               0               10         0        1
498   20               0               17         1        1
499   54               1               12         1        1

[207 rows x 5 columns]
     age  marital_status  salary(million)  have_car  is_join
1     42               0               22         1        0
2     23               1               13         0        0
8     26               0               13         0        0
10    35               0               16         1        0
12    54               1               16         1        0
..   ...             ...              ...       ...      ...
490   31               0               19         1        0
491   34               0               14         1        0
492   30               1               22         0        0
494   30               1               19         1        0
497   26               1               11         1        0

[293 rows x 5 columns]